OdDAI.OdSDAIInstance.isKindOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the Standard Data Access Interface (SDAI) instance belongs to a certain entity type with a specified name.
\param entityName [in] An ANSI string that contains the name of entitiy type.
\returns true if the SDAI instance belongs to the type of entity with the specified name; otherwise, the method returns false.